#include <stdio.h>
//讓使用者輸入10個整數後，印出10、20、30、...、100區間中有幾個數字印幾個*
//例如:15、16，屬於11~20的區間數，那就印出20:**

int main(){
    //先讓使用者輸入10個數字，因為不用重複查詢，所以值都暫存n不用陣列
    //若n屬於區間內的則印*(可用除10的方式去求)
    int i, j, n, b[11]={0};
    printf("請輸入10個整數:\n");
    for(i = 0; i < 10; i++){
        scanf("%d",&n);
        b[n / 10]++;
    }

    //%3d表示有三個位元數，為了讓數字對齊
    //依照累積的陣列數去印出對應的"*"
    //這邊"*"要印幾個，取決於b[i]裡面是幾
    for(i = 0; i <= 10; i++){
        printf("%3d: ", i * 10);
        if(b[i] > 0){
            for(j = 1; j <= b[i]; j++){
                printf("*");
            }
        }
        printf("\n");
    }
    return 0;
}

