#include <stdio.h>
/*
假設每次只走一階或兩階樓梯，
印出走到第N階可能走法的個數(N >= 1)
上三階樓梯的走法有(1,1,1),(1,2),(2,1)    三種
上四階樓梯的走法有(1,1,1,1),(1,1,2),(1,2,1),(2,1,1),(2,2)    五種
上五階樓梯的走法有八種
(1,1,1,1,1),(1,1,1,2),(1,1,2,1),(1,2,1,1),(1,2,2)第五階第一次若走1，後面走法跟四階一樣
(2,1,1,1),(2,1,2),(2,2,1) 若走2，後面走法跟三階一樣
所以上五階的八種，其實就是把三階跟四階的走法加在一起
由此可推理出
S(5) = S(4) + S(3)
S(N) = S(N-1) + S(N-2)
*/

int S(int);
int main(){
    int N;
    printf("N = ");
    scanf("%d", &N);
    printf("%d",S(N));
}
int S(int N){
    if(N == 1){
        return 1;
    }
    else if(N == 2){
        return 2;
    }
    else{
        return S(N-1) + S(N-2);
    }
    return N;
}
