#include <stdio.h>

int main(){
    /*
        //陣列存取可以調換v[3]位址順序:
        int v[3] = {1, 2, 3};
        int *p[3] = {&v[2], &v[0], &v[1]};
        int i;
        for(i = 0; i < &v[3]; i++){
            *p[i] = 0;
        }
        //此時v[3]陣列為{0, 0, 0};

        //隨機存取:
        *p[2] = 5;
        //此時v[3]陣列為{0, 5, 0};
    */

    int v[3] = {1, 2, 3};
    int *p = v;         //*p存取的是v整數陣列中第0個位址

   int i;    //初始化指標陣列裡的值，初始後v[3]陣列為{0, 0, 0};
   for(i = 0; i < &v[3]; i++){
        p[i] = 0;
   }

    p[2] = 5;   //v[3]陣列為{0, 0, 5};


    /*
        指標陣列也可以將三個不同的變數串成陣列
        int a = 3, b = 5, c = 7;
        int *p[3] = {&a, &b, &c}
        *p[2] = 5;  //c = 5;
    */

    /*
        整數陣列可以存取不同大小，但是要小心未定義行為
        int a[4] = {1,2,7,8};
        int b[2] = {3,4};
        int c[2] = {5,6};
        int *p[3] = {a, b, c};
        p[2][0] = 7;    //(&c[0])[0] = 7

        p[0][2] = 9;
        p[1][2] = 10;   //(x)未定義行為
    */

    return 0;
}
